# IsEqual Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WallSweepInfo..::..IsEqual Method
WallSweepInfo Class See Also
---
Determines if the input object is equivalent to this WallSweepInfo.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsEqual(
	WallSweepInfo toCompare
)
```

Visual Basic
---
```text
Public Function IsEqual ( _
	toCompare As WallSweepInfo _
) As Boolean
```

Visual C++
---
```text
public:
bool IsEqual(
	WallSweepInfo^ toCompare
)
```

# ### Parameters
toCompare
    Type: Autodesk.Revit.DB..::..WallSweepInfo
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
WallSweepInfo Class
Autodesk.Revit.DB Namespace